# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
#            (т.е. не меньше заданного минимума и не больше заданного максимума)
#       Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
#       Вывод: [1, 9, 13, 14, 19]  # Значения: [9, 10, 8, 10, 7]

input_array = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
output_array = []
print("Введите границы диапазона: ")
borders = [int(input()) for _ in range(2)]
for i in range(len(input_array)):
    if min(borders) <= input_array[i] <= max(borders):
        output_array.append(i)
print(output_array)
